app/controllers/events_controller.rb

 def import
   Event.destroy_all

   seatgeek = JSON.parse(open("http://api.seatgeek.com/2/events/?per_page=100").read)

   # add events from seatgeek.com to Event database

   seatgeek['events'].each do |listing|

      # if listing['venue']['state'] == "IL"

      a = Event.new
      a.name = listing['short_title']
      a.url = listing['venue']['url']
      a.category = listing['type']
      a.image = listing["performers"].first['image']
      # if a.image == nil
      #         a.image = listing["venue"].first['image']
      #       end
      a.location = "#{listing['venue']['address']} #{listing['venue']['city']}, #{listing['venue']['state']} #{listing['venue']['postal_code']}"
      a.venue = listing['venue']['name']
      a.zipcode = listing['venue']['postal_code']
      a.date = listing['datetime_local']
      a.start_time = listing['datetime_local']
      a.save
---
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 6]]
SELECT "events".* FROM "events"
INSERT INTO "events" ("category", "created_at", "date", "end_time", "image", "location", "name", "start_time", "updated_at", "url", "venue", "zipcode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("category", "created_at", "date", "end_time", "image", "location", "name", "start_time", "updated_at", "url", "venue") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)